zephyrproject-rtos/hal_nuvoton/m55m1x/StdDriver/src/sdh.c
        while (i < u32SecCount)
        {
            /* Read data from SD card to the temporary buffer buffer. */
            u32DrvRet = _SDH_Read(sdh, pu8NCBuffer, u32StartSec + i, 1);

            if (u32DrvRet != Successful)
                return u32DrvRet;

            /* Copy temporary buffer to user-data buffer after reading. */
            memcpy(pu8BufAddr + (i * SDH_BLOCK_SIZE), pu8NCBuffer, SDH_BLOCK_SIZE);

            i++;
        }
    }
    else
    {
        /* Read data from SD card to the destination buffer. */
        u32DrvRet = _SDH_Read(sdh, pu8BufAddr, u32StartSec, u32SecCount);

        if (u32DrvRet != Successful)
            return u32DrvRet;

#if (NVT_DCACHE_ON == 1)
        /* Invalidate data cache for data coherence */
        SCB_InvalidateDCache_by_Addr((void *)pu8BufAddr, u32SecCount * SDH_BLOCK_SIZE);
#endif
    }

    return Successful;
}

static uint32_t _SDH_Write(SDH_T *sdh, uint8_t *pu8BufAddr, uint32_t u32StartSec, uint32_t u32SecCount)
{
    uint32_t volatile bIsSendCmd = FALSE;
    uint32_t volatile reg;
    uint32_t volatile i, loop, status;
    int32_t u32TimeOutCount;

    SDH_INFO_T *pSD;

    if (sdh == SDH0)
    {
        pSD = &SD0;
    }
    else
    {
        pSD = &SD1;
    }

    pSD->i32ErrCode = 0;

    if (u32SecCount == 0ul)
    {
        return SDH_SELECT_ERROR;
    }

    if ((status = SDH_SDCmdAndRsp(sdh, 7ul, pSD->RCA, 0ul)) != Successful)
    {
        return status;
    }

    if (SDH_CheckRB(sdh) != Successful)
    {
        return SDH_ERR_TIMEOUT;
    }

    /* According to SD Spec v2.0, the write CMD block size MUST be 512, and the start address MUST be 512*n. */
    sdh->BLEN = SDH_BLOCK_SIZE - 1ul;

    if ((pSD->CardType == SDH_TYPE_SD_HIGH) || (pSD->CardType == SDH_TYPE_EMMC))
    {
        sdh->CMDARG = u32StartSec;
    }
    else
    {
        sdh->CMDARG = u32StartSec * SDH_BLOCK_SIZE;  /* set start address for SD CMD */
    }

    sdh->DMASA = (uint32_t)pu8BufAddr;
    loop = u32SecCount / 255ul;   /* the maximum block count is 0xFF=255 for register SDCR[BLK_CNT] */

    for (i = 0ul; i < loop; i++)
    {
        pSD->DataReadyFlag = (uint8_t)FALSE;
        reg = sdh->CTL & 0xff00c080;
        reg = reg | 0xff0000ul;   /* set BLK_CNT to 0xFF=255 */

        if (!bIsSendCmd)
        {
            sdh->CTL = reg | (25ul << 8) | (SDH_CTL_COEN_Msk |
                                            SDH_CTL_RIEN_Msk |
                                            SDH_CTL_DOEN_Msk);
            bIsSendCmd = TRUE;
        }
        else
        {
            sdh->CTL = reg | SDH_CTL_DOEN_Msk;
        }

        u32TimeOutCount = SDH_TIMEOUT_CNT;

        while (!pSD->DataReadyFlag)
        {
            if (pSD->IsCardInsert == FALSE)
            {
                return SDH_NO_SD_CARD;
            }

            if (--u32TimeOutCount <= 0)
            {
                pSD->i32ErrCode = SDH_ERR_TIMEOUT;
                break;
            }
        }

        if ((sdh->INTSTS & SDH_INTSTS_CRCIF_Msk) != 0ul)
        {
            sdh->INTSTS = SDH_INTSTS_CRCIF_Msk;
            return SDH_CRC_ERROR;
        }
    }

    loop = u32SecCount % 255ul;

    if (loop != 0ul)
    {
        pSD->DataReadyFlag = (uint8_t)FALSE;
        reg = (sdh->CTL & 0xff00c080) | (loop << 16);

        if (!bIsSendCmd)
        {
            sdh->CTL = reg | (25ul << 8) | (SDH_CTL_COEN_Msk |
                                            SDH_CTL_RIEN_Msk |
                                            SDH_CTL_DOEN_Msk);
            bIsSendCmd = TRUE;
        }
        else
        {
            sdh->CTL = reg | SDH_CTL_DOEN_Msk;
        }

        u32TimeOutCount = SDH_TIMEOUT_CNT;

        while (!pSD->DataReadyFlag)
        {
            if (pSD->IsCardInsert == FALSE)
            {
                return SDH_NO_SD_CARD;
            }

            if (--u32TimeOutCount <= 0)
            {
                pSD->i32ErrCode = SDH_ERR_TIMEOUT;
                break;
            }
        }

        if ((sdh->INTSTS & SDH_INTSTS_CRCIF_Msk) != 0ul)
        {
            sdh->INTSTS = SDH_INTSTS_CRCIF_Msk;
            return SDH_CRC_ERROR;
        }
    }

    sdh->INTSTS = SDH_INTSTS_CRCIF_Msk;

    if (SDH_SDCmdAndRsp(sdh, 12ul, 0ul, 0ul))      /* stop command */
    {
        return SDH_CRC7_ERROR;
    }

    if (SDH_CheckRB(sdh) != Successful)
    {
        return SDH_ERR_TIMEOUT;
    }

    SDH_SDCommand(sdh, 7ul, 0ul);
    sdh->CTL |= SDH_CTL_CLK8OEN_Msk;
    u32TimeOutCount = SDH_TIMEOUT_CNT;

    while ((sdh->CTL & SDH_CTL_CLK8OEN_Msk) == SDH_CTL_CLK8OEN_Msk)
    {
        if (--u32TimeOutCount <= 0)
        {
            pSD->i32ErrCode = SDH_ERR_TIMEOUT;
            break;
        }
    }

    if (pSD->i32ErrCode != 0)
        return Fail;

    return Successful;
}

/**
 *  @brief  This function use to write data to SD card.
 *
 *  @param[in]    sdh           Select SDH0 or SDH1.
 *  @param[in]    pu8BufAddr    The buffer to send the data to SD card.
 *  @param[in]    u32StartSec   The start write sector address.
 *  @param[in]    u32SecCount   The the write sector number of data.
 *
 *  @return   \ref SDH_SELECT_ERROR : u32SecCount is zero.
 *            \ref SDH_NO_SD_CARD : SD card be removed.
 *            \ref SDH_CRC_ERROR : CRC error happen.
 *            \ref SDH_CRC7_ERROR : CRC7 error happen.
 *            \ref Successful : Write data to SD card success.
 */
uint32_t SDH_Write(SDH_T *sdh, uint8_t *pu8BufAddr, uint32_t u32StartSec, uint32_t u32SecCount)
{
    uint32_t u32DrvRet;

    /* Check for alignment to word or cache line boundaries. */
    if ((uint32_t)pu8BufAddr % DEF_ALIGNED_VALUE)
    {
        int i = 0;
        uint8_t *puNCBuffer;

        if (sdh == SDH0)
        {
            puNCBuffer = _SDH0_ucSDHCBuffer;
        }
        else if (sdh == SDH1)
        {
            puNCBuffer = _SDH1_ucSDHCBuffer;
        }
        else
        {
            return Fail;
        }

        while (i < u32SecCount)
        {
            /* Copy user data to the temporary buffer to prepare for writing to the SD card. */
            memcpy(puNCBuffer, pu8BufAddr + (i * SDH_BLOCK_SIZE), SDH_BLOCK_SIZE);

            /* Flush the data cache for the temporary buffer before writing to the SD card.
             * This ensures that all cached data is written to memory before the write operation. */
            u32DrvRet = _SDH_Write(sdh, puNCBuffer, u32StartSec + i, 1);

            if (u32DrvRet != Successful)
                return u32DrvRet;

            i++;
        }
    }
    else
    {
#if (NVT_DCACHE_ON == 1)
        /* Flush specific data cache address before writing to the SD card */
        SCB_CleanDCache_by_Addr((void *)pu8BufAddr, u32SecCount * SDH_BLOCK_SIZE);
#endif

        /* Write data from the destination buffer to specific sector address. */
        u32DrvRet = _SDH_Write(sdh, pu8BufAddr, u32StartSec, u32SecCount);

        if (u32DrvRet != Successful)
            return u32DrvRet;
    }

    return Successful;
}

/** @} end of group SDH_EXPORTED_FUNCTIONS */
/** @} end of group SDH_Driver */
/** @} end of group Standard_Driver */
